In [7]:
from sqllite_helper import SQLite3Helper

task = SQLite3Helper()

In [8]:
task.create_connection(db_file="database.db")

Conexão criada, novo database: database.db

In [10]:
data = {'codigo_cliente': ['1', '2' , '3', '4', '5', '6', '7', '8', '9', '10'],
        'nome':  ['Lucas', 'Bruno', 'Roberto', 'Carla', 'Mirella', 'Matheus', 'Gabriel', 'Filipe', 'Nicolas', 'Larissa'],
        'idade': [22, 35, 18, 24, 60, 54, 44, 27, 36, 38],
        'gerente_da_conta': ['Leandro', 'Eduardo', 'Roberto', 'Leandro', 'Eduardo', 'Roberto', 'Leandro', 'Eduardo', 'Roberto', 'Leandro'],
        'conta_corrente': ['1234', '4321', '5554', '4585', '4856', '9847', '8854', '6541', '3659', '4751'],
        'tipo_conta_corrente': ['Povão', 'Chefão', 'Ricão', 'Povão', 'Chefão', 'Ricão', 'Povão', 'Chefão', 'Ricão', 'Povão'],
        'score': [400, 800, 650, 350, 850, 700, 375, 736, 682, 530]
        }

In [11]:
import pandas as pd

df = pd.DataFrame(data)

print(df)

  codigo_cliente     nome  idade gerente_da_conta conta_corrente  \
0              1    Lucas     22          Leandro           1234
1              2    Bruno     35          Eduardo           4321
2              3  Roberto     18          Roberto           5554
3              4    Carla     24          Leandro           4585
4              5  Mirella     60          Eduardo           4856
5              6  Matheus     54          Roberto           9847
6              7  Gabriel     44          Leandro           8854
7              8   Filipe     27          Eduardo           6541
8              9  Nicolas     36          Roberto           3659
9             10  Larissa     38          Leandro           4751

  tipo_conta_corrente  score
0               Povão    400
1              Chefão    800
2               Ricão    650
3               Povão    350
4              Chefão    850
5               Ricão    700
6               Povão    375
7              Chefão    736
8               Ricão    682
9               Povão    530

In [12]:
task.create_table(df=df, db_file='database.db', table_name='clientes')

Criando tabela clientes no database database.db
Tabela criada

In [13]:
query = "select * from clientes"

task.run_query(db_file="database.db", query=query)

Rodando Query
DataFrame disponível com resultado da query

,index,codigo_cliente,nome,idade,gerente_da_conta,conta_corrente,tipo_conta_corrente,score
0,0,1,Lucas,22,Leandro,1234,Povão,400
1,1,2,Bruno,35,Eduardo,4321,Chefão,800
2,2,3,Roberto,18,Roberto,5554,Ricão,650
3,3,4,Carla,24,Leandro,4585,Povão,350
4,4,5,Mirella,60,Eduardo,4856,Chefão,850
5,5,6,Matheus,54,Roberto,9847,Ricão,700
6,6,7,Gabriel,44,Leandro,8854,Povão,375
7,7,8,Filipe,27,Eduardo,6541,Chefão,736
8,8,9,Nicolas,36,Roberto,3659,Ricão,682
9,9,10,Larissa,38,Leandro,4751,Povão,530

In [22]:
query = "ALTER TABLE clientes DROP index;"

In [23]:
task.run_query(db_file="database.db", query=query)

Rodando Query

DatabaseError: Execution failed on sql 'ALTER TABLE clientes DROP index;': near "index": syntax error